#Dobókockás feladat
#leírás :
#	Állapítsuk meg, hogy szabályos e a dobókocka. 
#	Jelölje Ai azt, hogy i-est dobtunk (i=1,2,3,4,5,6)
#	Nullhipotézis H0 : P(Ai) = (1/6)  i=(1,2,3,4,5,6)
# A kockát 600x feldobtuk.
#
#	k1=83
#	k2=91
#	k3=122
#	k4=107
#	k5=74
#	k6=123
# SUM(i=1 r ig)((ki-N*pi)^2)/N*pi 
# N=600 p1=p2=p3=p4=p5=p6=(1/6)
# Behelyettesítünk a képletbe, a ki értékeket. 
#  (83-600*(1/6)^2	/	600*(1/6)+
# + (91-600*(1/6)^2	/	600*(1/6)+
# + (122-600*(1/6)^2	/	600*(1/6)+
# + (107-600*(1/6)^2	/	600*(1/6)+
# + (74-600*(1/6)^2	/	600*(1/6)+
# + (123-600*(1/6)^2	/	600*(1/6)=
#
# + (83-100)^2		/	100+
# + (91-100)^2		/	100+
# + (112-100)^2		/	100+
# + (107-100)^2		/	100+
# + (74-100)^2		/	100+
# + (123-100)^2		/	100=
#
# = -17^2			/	100+
# + -9^2			/	100+
# + 22^2			/	100+
# + 7^2			/	100+
# + -26^2			/	100+
# + 23^2			/	100+
#
# =(289+81+484+49+676+529)/100=2108/100=21,08
# A Kontingencia táblázat szerint 95% os pontosságnál ez 11,07 Szóval nem fogadjuk el! 

p <-1/6
A <-c(83,91,122,107,74,123)
N <-600


while(i <=6)
{
	
}

